Masmiseim36/nxpSDK/boards/evkbimxrt1050/ew_gui_examples/ew_gui_pulse_oximeter/pin_mux.h
/*
 * Copyright 2017-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_UART1_RXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_RXD_SIGNAL                                                RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_UART1_TXD_PERIPHERAL                                       LPUART1   /*!< Peripheral name */
#define BOARD_UART1_TXD_SIGNAL                                                TX   /*!< Signal name */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_LCDIF_CLK_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_CLK_SIGNAL                                         lcdif_clk   /*!< Signal name */

/* GPIO_B0_04 (coord C8), LCDIF_D0/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_LCDIF_D0_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D0_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D0_CHANNEL                                                0U   /*!< Signal channel */

/* GPIO_B0_05 (coord B8), LCDIF_D1/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_LCDIF_D1_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D1_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D1_CHANNEL                                                1U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_LCDIF_D2_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D2_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D2_CHANNEL                                                2U   /*!< Signal channel */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_LCDIF_D3_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D3_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D3_CHANNEL                                                3U   /*!< Signal channel */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_LCDIF_D4_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D4_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D4_CHANNEL                                                4U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_LCDIF_D5_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D5_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D5_CHANNEL                                                5U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_LCDIF_D6_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D6_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D6_CHANNEL                                                6U   /*!< Signal channel */

/* GPIO_B0_11 (coord A10), LCDIF_D7/BT_CFG[7] */
/* Routed pin properties */
#define BOARD_LCDIF_D7_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D7_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D7_CHANNEL                                                7U   /*!< Signal channel */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_LCDIF_D8_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D8_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D8_CHANNEL                                                8U   /*!< Signal channel */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_LCDIF_D9_PERIPHERAL                                          LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D9_SIGNAL                                         lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D9_CHANNEL                                                9U   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_LCDIF_D10_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D10_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D10_CHANNEL                                              10U   /*!< Signal channel */

/* GPIO_B0_15 (coord E11), LCDIF_D11/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_LCDIF_D11_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D11_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D11_CHANNEL                                              11U   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_LCDIF_D12_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D12_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D12_CHANNEL                                              12U   /*!< Signal channel */

