Masmiseim36/nxpSDK/boards/evkbimxrt1050/ew_gui_examples/ew_gui_pulse_oximeter/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_LCDIF_D13_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D13_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D13_CHANNEL                                              13U   /*!< Signal channel */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_LCDIF_D14_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D14_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D14_CHANNEL                                              14U   /*!< Signal channel */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_LCDIF_D15_PERIPHERAL                                         LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_D15_SIGNAL                                        lcdif_data   /*!< Signal name */
#define BOARD_LCDIF_D15_CHANNEL                                              15U   /*!< Signal channel */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_LCDIF_ENABLE_PERIPHERAL                                      LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_ENABLE_SIGNAL                                   lcdif_enable   /*!< Signal name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_LCDIF_HSYNC_PERIPHERAL                                       LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_HSYNC_SIGNAL                                     lcdif_hsync   /*!< Signal name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
/* Routed pin properties */
#define BOARD_LCDIF_VSYNC_PERIPHERAL                                       LCDIF   /*!< Peripheral name */
#define BOARD_LCDIF_VSYNC_SIGNAL                                     lcdif_vsync   /*!< Signal name */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
/* Routed pin properties */
#define BOARD_BACKLIGHT_CTL_PERIPHERAL                                     GPIO2   /*!< Peripheral name */
#define BOARD_BACKLIGHT_CTL_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_BACKLIGHT_CTL_CHANNEL                                          31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_BACKLIGHT_CTL_GPIO                                           GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_BACKLIGHT_CTL_GPIO_PIN                                         31U   /*!< GPIO pin number */
#define BOARD_BACKLIGHT_CTL_GPIO_PIN_MASK                            (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_BACKLIGHT_CTL_PORT                                           GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_BACKLIGHT_CTL_PIN                                              31U   /*!< PORT pin number */
#define BOARD_BACKLIGHT_CTL_PIN_MASK                                 (1U << 31U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A0_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A0_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A0_CHANNEL                                    0U   /*!< Signal channel */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A1_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A1_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A1_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A2_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A2_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A2_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A3_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A3_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A3_CHANNEL                                    3U   /*!< Signal channel */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A4_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A4_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A4_CHANNEL                                    4U   /*!< Signal channel */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A5_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A5_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A5_CHANNEL                                    5U   /*!< Signal channel */

/* GPIO_EMC_15 (coord B1), SEMC_A6 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A6_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A6_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A6_CHANNEL                                    6U   /*!< Signal channel */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A7_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A7_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A7_CHANNEL                                    7U   /*!< Signal channel */

