Masmiseim36/nxpSDK/boards/evkbimxrt1050/ew_gui_examples/ew_gui_pulse_oximeter/pin_mux.h
/* GPIO_EMC_17 (coord A4), SEMC_A8 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A8_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A8_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A8_CHANNEL                                    8U   /*!< Signal channel */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A9_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A9_SIGNAL                                   ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A9_CHANNEL                                    9U   /*!< Signal channel */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A10_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A10_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A10_CHANNEL                                  10U   /*!< Signal channel */

/* GPIO_EMC_19 (coord B4), SEMC_A11 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A11_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A11_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A11_CHANNEL                                  11U   /*!< Signal channel */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_A12_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_A12_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_A12_CHANNEL                                  12U   /*!< Signal channel */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_BA0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_BA0_SIGNAL                                    BA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_BA0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_BA1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_BA1_SIGNAL                                    BA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_BA1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_24 (coord D3), SEMC_CAS */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CAS_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CAS_SIGNAL                              semc_cas   /*!< Signal name */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CKE_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CKE_SIGNAL                              semc_cke   /*!< Signal name */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CLK_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CLK_SIGNAL                              semc_clk   /*!< Signal name */

/* GPIO_EMC_29 (coord E1), SEMC_CS0 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_CS0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_CS0_SIGNAL                                    CS   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_CS0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D0_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D0_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D0_CHANNEL                                    0U   /*!< Signal channel */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D1_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D1_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D1_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D2_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D2_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D2_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D3_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D3_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D3_CHANNEL                                    3U   /*!< Signal channel */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D4_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D4_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D4_CHANNEL                                    4U   /*!< Signal channel */

/* GPIO_EMC_05 (coord G5), SEMC_D5 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D5_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D5_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D5_CHANNEL                                    5U   /*!< Signal channel */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D6_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D6_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D6_CHANNEL                                    6U   /*!< Signal channel */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D7_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D7_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D7_CHANNEL                                    7U   /*!< Signal channel */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D8_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D8_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D8_CHANNEL                                    8U   /*!< Signal channel */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D9_PERIPHERAL                               SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D9_SIGNAL                                   DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D9_CHANNEL                                    9U   /*!< Signal channel */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D10_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D10_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D10_CHANNEL                                  10U   /*!< Signal channel */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
/* Routed pin properties */
#define BOARD_INITSEMCPINS_SEMC_D11_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSEMCPINS_SEMC_D11_SIGNAL                                  DATA   /*!< Signal name */
#define BOARD_INITSEMCPINS_SEMC_D11_CHANNEL                                  11U   /*!< Signal channel */

